# vsoADPAddDimPlace

## Description
Add a dimension placement to a dimension type result that has begun for the Auto Dimension GetSupportedTypes (77) message sent to a Script object.

```pascal
PROCEDURE vsoADPAddDimPlace(
				message : LONGINT;
				dimType : INTEGER);
```

```python
def vs.vsoADPAddDimPlace(message, dimType):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|message|LONGINT|   |
|dimType|INTEGER|   |

## Version
Availability: from Vectorworks 2023

## Category
* Object Events